package com.example.week5

import android.content.Intent
import androidx.appcompat.app.AppCompatActivity
import android.os.Bundle
import android.widget.ArrayAdapter
import android.widget.Toast
import kotlinx.android.synthetic.main.activity_main.*

class MainActivity : AppCompatActivity() {

    public final var YING = ""

    val title = arrayOf("Airniversary Camp&Cafe"
        ,"Warm Up Cafe"
        ,"ท่าช้างคาเฟ่"
        ,"The Good View Bar And Restaurant"
        ,"Milk Club"
        ,"Infinity"
        ,"Warp Bar & Bistro Star Avenue อาเขต"
        ,"ZOE IN YELLOW"
        ,"Myst MAYA MAYA Chiang Mai"
        ,"ตะวันแดง มหาซน เชียงใหม่")
    val priceArr = arrayOf("“Airniversary Camp&Cafe” เป็นคาเฟ่ใจกลางเมืองเชียงใหม่บรรยากาศสบาย ๆ มีต้องไม้ล้อมรอบ เหมาะแก่การนั่งพักผ่อนย่อนใจ และเคลิบเคลิ้มไปกับรสชาติอาหารและเครื่องดื่ม\n" +
            " ในราคาที่สบายกระเป๋าตังค์ บริการดีเยี่ยม มีที่จอดรถสะดวก\n" +
            " ถ้าใครผ่านมาผ่านไปแล้วมองหาคาเฟ่ดี ๆ นั่ง แนะนำว่าควรมาลองแล้วจะติดใจไม่อยากไปไหนอีกเลย\n" +
            "ตั้งอยู่ที่ 1/8 (ถนนราชภาคินัย) พระสิงห์ , เมืองเชียงใหม่ , เชียงใหม่\n" +
            "เบอร์ติดต่อ 053-280-996\n" +
            "เวลาเปิดบริการ จันทร์ - อังคาร : 08:00 - 23:00, พฤหัสบดี - อาทิตย์ : 08:00 - 23:00\n" +
            "ประเภท อาหารไทย , กึ่งผับ/ร้านเหล้า/บาร์ อ่านต่อได้ที่ https://www.wongnai.com/listings/sexy-girls-nightlife-cm?ref=ct"

        ,"Warm Up Cafe“เป็บผับชื่อดังมาก ๆ ของเชียงใหม่เลยทีเดียวสำหรับเมนูอาหารที่สั่งคือ เหล้าเป็นหลัก มิ๊กเซอร์เป็นรอง กับแกล้มตามมา เห็ดทอดซอสกระเทียม แนะนำอร่อย อีกอย่างหนึ่งที่เด็ดก็คือสาว ๆ บอกเลยว่าดูเพลินมาก คนเยอะสุด ๆ \n" +
                "โดยเฉพาะคืนวันศุกร์-เสาร์ การบริการดีมาก เพลงสนุกเสียงดัง” (โดยคุณ bluebrother)\n" +
                "ตั้งอยู่ที่ 40 ถนน นิมมานเหมินทร์ ตำบล สุเทพ อำเภอ เมืองเชียงใหม่ (นิมมานเหมินท์ ก่อนถึงสามแยก) สุเทพ , เมืองเชียงใหม่ , เชียงใหม่\n" +
                "เบอร์ติดต่อ 053-400-677\n" +
                "เวลาเปิดบริการ ทุกวัน : 18:00 - 01:00\n" +
                "ประเภท ผับ/เที่ยวกลางคืน อ่านต่อได้ที่ https://www.wongnai.com/listings/sexy-girls-nightlife-cm?ref=ct\n"

        ,"ท่าช้างคาเฟ่“แหล่งรวมวัยรุ่น สาวสวยเยอะดีครับ ไม่มีดนตรีสด มีแต่เปิดเพลงไทยแนวต่าง ๆ เด็ก ๆ ที่มานั่งก็แต่งตัวคนละแบบกับแถบฝั่งริมน้ำปิง แต่เรื่องราคาถูกกว่ามาก ๆ ร้านกว้างขวาง เมนูกับแกล้มเยอะดี มีน้อง ๆ \n" +
                "มาคอยถามตลอดเอาเมนูมาให้ดูถึงโต๊ะ ว่าเอานั่นมั้ยนี่มั้ย เครื่องดื่มสุดฮิตก็คือบัคเก็ตรสชาติต่าง ๆ “ (โดยคุณ เสี่ยวเอ้อ)\n" +
                "ตั้งอยู่ที่ 11/9 ถนน รัตนโกสินทร์ อำเภอเมืองเชียงใหม่ ช้างเผือก , เมืองเชียงใหม่ , เชียงใหม่\n" +
                "เบอร์ติดต่อ 082-028-3736\n" +
                "เวลาเปิดบริการ ทุกวัน : 17:00 - 23:59\n" +
                "ประเภท กึ่งผับ/ร้านเหล้า/บาร์ อ่านต่อได้ที่ https://www.wongnai.com/listings/sexy-girls-nightlife-cm?ref=ct"

        ,"The Good View Bar And Restaurant“มาเชียงใหม่ ถ้าไม่มาที่นี้ แสดงว่ามาไม่ถึงเชียงใหม่ ที่ต้องบอกแบบนี้ก็เพราะขาดื่ม เที่ยว สังสรรค์จะรู้ดีถ้าเชียงใหม่ต้องมาอีกนี้ เพราะนอกจากเครื่องดื่มจะมีให้เลือกเยอะแล้ว สาว ๆ ที่มาเที่ยวก็ยังมีให้มองเยอะด้วย \n" +
                "เพลินตาถูกใจคนโสดเลยทีเดียว ยิ่งตกดึกมาเต้นกันกระจาย อาหารก็อร่อย” (โดยคุณ Songwut Bigger)\n" +
                "ตั้งอยู่ที่ 30, ถนนเจริญราษฎร์ (จากตัวเมือง ข้ามสะพานนวรัฐ เจอสี่แยกไฟแดงให้เลี้ยวซ้ายไปตามถนนเจริญราษฏร์ ขับตรงไปเรื่อยผ่านระรินจินดาเวลเนสสปารีสอร์ท\n" +
                " จะพบร้านอยู่ซ้ายมือริมน้ำปิงตรงข้ามปั๊ม ปตท) ช้างม่อย , เมืองเชียงใหม่ , เชียงใหม่\n" +
                "เบอร์ติดต่อ 053-302-764 , 053-241-866 , 099-271-0666\n" +
                "เวลาเปิดบริการ ทุกวัน : 10:00 - 01:00\n" +
                "ประเภท ร้านริมน้ำ , ผับ/เที่ยวกลางคืน , กึ่งผับ/ร้านเหล้า/บาร์ อ่านต่อได้ที่ https://www.wongnai.com/listings/sexy-girls-nightlife-cm?ref=ct"

        ,"Milk Club\"พอลงรถมาก็รู้สึกเลยว่านี่ไม่ใช่ร้านใหม่ แค่ที่นี่คือ Milk Club ร้านเดิม แม้บรรยากาศจะเปลี่ยนไปแต่ เสียงหัวเราะ เฮฮา รอยยิ้ม จากทั้งลูกค้า และ น้อง ๆ สาวสวยในร้าน นั้นยังคงไม่เปลี่ยนไปมีแต่มากขึ้นกว่าเดิมด้วยซ้ำ\n" +
                " นับว่ายังคงคอนเซปต์ที่ว่า “Milk Club สนุก สุดมัน” ได้ดีจริง ๆ ส่วนเรื่องอาหาร และเครื่องดื่มก็ยังมีบริการแบบจัดเต็มเหมือนเดิม เพิ่มเติมคือความแซ่บ!\" (โดยคุณ Gymmii เจ้าหมีกินแหลก)\n" +
                "ตั้งอยู่ที่ ซ.แม่ข่าน้อย 3 ถ.มหิดล อ.เมือง เชียงใหม่ (จากสี่แยกสนามบินตรงไปทางกองบัญชาการตำรวจภูธรภาค ๕ จากนั้นยูเทิร์นใต้สะพานกลับมาทางสี่แยกสนามบินประมาณ 3 กิโลเมตร \n" +
                "สังเกตปั้มคาลเท็กซ์ขวามือ เลี้ยวซ้ายเข้าซอยเดียวกับอันดามันซีฟู๊ด เลยมาตรงหัวมุมร้านจะอยู่ขวามือ ใกล้สนามบอล) หายยา , เมืองเชียงใหม่ , เชียงใหม่\n" +
                "เบอร์ติดต่อ 086 329 4156\n" +
                "เวลาเปิดบริการ ทุกวัน : 17:00 - 23:59\n" +
                "ประเภท กึ่งผับ/ร้านเหล้า/บาร์ , ผับ/เที่ยวกลางคืน อ่านต่อได้ที่ https://www.wongnai.com/listings/sexy-girls-nightlife-cm?ref=ct"

        ,"Infinity“เป็นอีกหนึ่งร้านสำหรับคนชอบเที่ยวกลางคืน เพราะที่นี่อีกผับที่นักศึกษา ทั้งหนุ่มหล่อ สาวสวย ชอบไปเที่ยวกันในยามค่ำคืน ราคามิกซ์เซอร์ก็เหมาะสมกับราคา ดนตรีสดสุดมันหลากหลายสไตล์ มีให้เลือกทั้งโซนนอกสำหรับนั่งกินข้าว \n" +
                "และโซนดื่มเหล้าเมาแด๊นซ์ทางด้านใน สรุปได้มาตรฐานผับทั่วไป” (โดยคุณ Pote' Entaneer)\n" +
                "ตั้งอยู่ที่ นิมมานเหมินท์ ซอย 6 (ร้านอยู่ในซอยนิมมานซอย6) ช้างเผือก , เมืองเชียงใหม่ , เชียงใหม่\n" +
                "เบอร์ติดต่อ 053-400-084\n" +
                "เวลาเปิดบริการ ทุกวัน : 18:00 - 00:30\n" +
                "ประเภท ผับ/เที่ยวกลางคืน อ่านต่อได้ที่ https://www.wongnai.com/listings/sexy-girls-nightlife-cm?ref=ct"

        ,"Warp Bar & Bistro Star Avenue อาเขต“คนแน่นร้านทุกวันร้านอยู่ด้านบนดาดฟ้า ของคอมมูนิตี้มอลล์ สตาร์อเวนิว อาเขต บรรยากาศดีพอใช้ แต่เบียร์ถูกดีนะ กับแกล้มมีไม่มาก จุดเด่นคงเป็นสถานที่ กับดนตรีสดนะครับ \n" +
                "เพลงเพราะดี เหมาะกับมานั่งดื่มกินเบา ๆ คุยกันง่าย” (โดยคุณ Todsapol Eiumlaor)\n" +
                "ตั้งอยู่ที่ 8/42 Star Avenue 2 ตำบล วัดเกต อำเภอเมืองเชียงใหม่ (ชั้น 3 โครงการสตาร์ อเวนิว 2 (อาเขต)) วัดเกต , เมืองเชียงใหม่ , เชียงใหม่\n" +
                "เบอร์ติดต่อ 081-322-4282\n" +
                "เวลาเปิดบริการ ทุกวัน : 17:00 - 23:59\n" +
                "ประเภท กึ่งผับ/ร้านเหล้า/บาร์ , ร้านบนดาดฟ้า อ่านต่อได้ที่ https://www.wongnai.com/listings/sexy-girls-nightlife-cm?ref=ct"

        ,"ZOE IN YELLOW“ร้านนี้ลูกค้าส่วนใหญ่จะเป็นชาวต่างชาติค่ะ เป็นร้านเปิดแผ่นแดนซ์กระจาย เน้นขายเฉพาะเครื่องดื่ม เด่น ๆ ก็จะเป็นพวกค็อกเทล บัคเก็ต แล้วก็เบียร์ค่ะ แต่ถ้าใครกลัวเหงาปาก \n" +
                "ก็สามารถเดินไปซื้ออาหารรถเข็นข้างนอกเข้ามาทานได้นะคะ ดริงค์ ๆ \n" +
                "แดนซ์ ๆ ร้านนี้มันส์ค่ะ” (โดยคุณ Ap Ple)\n" +
                "ตั้งอยู่ที่ ถนน ราชภาคินัย ตำบล ศรีภูมิ อำเภอเมืองเชียงใหม่ (ข้างโรงเรียนยุพราชฯ) ศรีภูมิ , เมืองเชียงใหม่ , เชียงใหม่\n" +
                "เบอร์ติดต่อ 094-262-3551 , 083-989-4925\n" +
                "เวลาเปิดบริการ ทุกวัน : 17:00 - 23:59\n" +
                "ประเภท กึ่งผับ/ร้านเหล้า/บาร์ อ่านต่อได้ที่ https://www.wongnai.com/listings/sexy-girls-nightlife-cm?ref=ct"

        ,"Myst MAYA MAYA Chiang Mai“Myst MAYA สถานที่ Hang Out แห่งใหม่วัยมันส์ผุดขึ้นมาบน Rooftop ของเมญ่า ตกแต่งเริ่ดแสงสีตระการตาตามสไตล์ ตื๊ด-ตื๊ด บรรยากาศดี\n" +
                " เพราะอยู่บน Rooftop มี 2 ชั้นด้วย ได้ข่าวสาว ๆ\n" +
                " เต็มเกือบทุกวันเลย มาถึงนี่ก็ต้องจัดไป เครื่องดื่มค็อกเทลสุดเว่อวังอลังการงานเอฟเฟกต์” (โดยคุณ Ploy Bood)\n" +
                "ตั้งอยู่ที่ 55 MAYA Shopping Center (ชั้น 6 เมญ่า) ช้างเผือก , เมืองเชียงใหม่ , เชียงใหม่\n" +
                "เบอร์ติดต่อ 061-512-6768,052-081-101,052-081-102\n" +
                "เวลาเปิดบริการ ทุกวัน : 18:00 - 01:00\n" +
                "ประเภท ผับ/เที่ยวกลางคืน , ร้านบนดาดฟ้า อ่านต่อได้ที่ https://www.wongnai.com/listings/sexy-girls-nightlife-cm?ref=ct"

        ,"ตะวันแดง มหาซน เชียงใหม่ “การมาที่นี่ครั้งแรกนั้นไม่ได้ทำให้ผมผิดหวังแต่อย่างใด และสำหรับเพื่อน ๆ ที่ยังไม่เคยแวะมาใช้บริการ ผมบอกเลยว่าอย่าช้าครับ ลองมาดูซักครั้งแล้วจะติดใจกับทั้ง อาหาร บรรยากาศ และ สาวสวยที่มีให้มองอยู่แบบแทบจะเต็มร้านเลย \n" +
                "ต้องลองมาซักครั้งเชื่อผมสิ!” (โดยคุณ Gymmii เจ้าหมีกินแหลก)\n" +
                "ตั้งอยู่ที่ 73 ถนนคลองชลประทาน ตำบลสุเทพ อำเภอเมืองเชียงใหม่ (ใกล้ตลาดกาดเชิงดอย) สุเทพ , เมืองเชียงใหม่ , เชียงใหม่\n" +
                "เบอร์ติดต่อ 083-204-7881\n" +
                "เวลาเปิดบริการ ทุกวัน : 19:00 - 01:00\n" +
                "ประเภท กึ่งผับ/ร้านเหล้า/บาร์ , อาหารนานาชาติ อ่านต่อได้ที่ https://www.wongnai.com/listings/sexy-girls-nightlife-cm?ref=ct")
    val context = this

    override fun onCreate(savedInstanceState: Bundle?) {
        super.onCreate(savedInstanceState)
        setContentView(R.layout.activity_main)

        setTitle("สถานบันเทิง")
        val mAdp = ArrayAdapter(context,android.R.layout.simple_list_item_1,title)
        lv_result.adapter = mAdp

        lv_result.setOnItemClickListener { parent, view, position, id ->

           // Toast.makeText(context,
                                  //" สถานทันเทิง = ${title[position]} ราคา ${priceArr[position]}",Toast.LENGTH_LONG).show()
         var place = priceArr[position];
            send(place)

        }
    }
    fun send(str : String){
        var gopage = Intent(this,Place ::class.java)
        gopage.putExtra(YING,str)
        startActivity(gopage)
    }
}
